{
  "main": {
    "name": "Nakamoto Fukuda",
    "occupation": "Full Stack and Blockchain Developer",
    "description": "",
    "image": "profilepic.jpg",
    "bio": "Hello, Everyone. I'm Professional Blockchain, Web developer with 6 years of experience. My development is always tailored to be of top-tier quality, to be associated with well-documented notes and instructions for the client & future developers, while maintaining full development security using technological audits, through testing and proven protection-building against malicious parties/hackers. I'm highly skilled in React, JavaScript, Typescript, Angular, Python, Selenium, PHP, Laravel, Three.js, Web3.js, Solidity and Rust programming languages. I have good experiences of Decentralized Application Development(CEX/DEX and Staking/ Defi Dapps), Smart contract Development, NFT Minting site/Marketplace Development, Cryptocurrency & Token Creation/ Launchpad, Web application Development. When working on a new project, I like to speak with clients so that I can have a clear understanding of their requirements and vision of the project and can implement perfectly. If you are interested me, please send me message and then we will arrange a call at your convenience. Have a great day and I look forward to speaking soon.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "truesight9705@gmail.com",
    "phone": "+1 321 257 8668",
    "telegram": "https://t.me/bestdev00",
    "skype":"live:.cid.7c0f73c7c0c419a0",
    "address": {
      "street": "197-1243, Kudamminami, Chiyoda-ku",
      "city": "Tokyo",
      "state": "Tokyo",
      "zip": "102-0074"
    },
    "website": "http://fukudadev.onrender.com",
    "resumedownload": "https://drive.google.com/file/d/1ctAiIHHTZHtK7RQywJIP13Ps2T0JlcCw/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/kryptify",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I have skills with Full Stack and Blockchain etc.",
    "education": [
      {
        "school": "Chiba University",
        "degree": "Bachelor of Computer Science, Software Engineering Option",
        "graduated": "April 2015",
        "description": "Here I took my Bachelors of Computer Science with a Software Engineering Specialty and achieved a much more thorough education in the underlying theory, concepts, and science behind more complex programming. It was here that I discovered my passion for scalable application programming (web and mobile), the security behind computer and application systems, and found that I have a knack for understanding complex algorithms."
      }
    ],
    "work": [
      {
        "company": "Maxos",
        "title": "Senior Blockchain Developer ",
        "years": "December 2021 - Setember 2022",
        "description1": "- Implemented Smart contracts to protocols for new DeFi financial services(launch Pool)",
        "description2": "- Implemented JavaScript transactions to use in React front-end.",
        "description3": "- Created and submit blockchain transactions from JSclients.",
        "description4": "- Set up new projects with repositories and builds and tests. ",
        "description5": "- Implemented security to contracts that handle money."
      },
      {
        "company": "Prime Protocol",
        "title": "Senior Smart contract developer",
        "years": "Octember 2020 - Setember 2021",
        "description1": "- Improved functionalities and pipeline integration by designing and implementing Smart Contract Security Audit from SlowMist.",
        "description2": "- Built decentralized exchange and decentralized finance contract with Rust language. ",
        "description3": "- Contributed to an 23% rise in subscribers for 8 months by enhancing the player experience on all supported client platforms.",
        "description4": "- Implemented contracts using Anchor frameworks and Rust language.",
        "description5": "- Ensured tight cooperation with other engineers, designers, and artists through active listening, systematic communication, and leadership skills.",
        "description6": "- Fixed bugs and problems across the entire team members in an efficient, timely manner."
      },
      {
        "company": "FIXER",
        "title": "Full Stack Blockchain Developer ",
        "years": "May 2018 - August 2020",
        "description1": "- Managed both back-end and front-end aspects of development process.",
        "description2": "- Completed code debugging and implemented fixes to resolve problems based on priority system. ",
        "description3": "- Developed/Enhanced new pages with fixing current issues in frontend (react.js + next.js) ",
        "description4": "- Dapps/ DEFI platform for Staking / Yield farm / Lending & borrowing system / NFT marketplace / Crypto Game(play to earn), DAO, DEX fork, Auto trading Bot / Snipping Bot(Front-run, Arbitrage) "
      },
      {
        "company": "VID CLOUD",
        "title": "Full Stack Developer ",
        "years": "Octember 2016 - February 2018",
        "description1": "I’ve built Mobile Applications, Ecommerce website, real estate website, Education website, Betting Website, Job website, and so on… Completed course on front-end web development that involved deploying real interactive apps that make API calls and fetch data based on user input. Also involved functional programming and game development in client side applications."
      },
      {
        "company": "F12.NET",
        "title": "Software Developer ",
        "years": "June 2015 - Setember 2016",
        "description1": "- I worked in Artificial Intelligence, custom software development, enterprise app modernization.",
        "description2": "- Done lots of Research tasks given by my Boss.",
        "description3": "- Done various website design with Html and CSS."
      }
    ],
    "skills": [
      {
        "name": "REACT",
        "level": "100%"
      },
      {
        "name": "JavaScript",
        "level": "100%"
      },
      {
        "name": "BLOCKCHAIN",
        "level": "98%"
      },
      {
        "name": "NODEJS",
        "level": "97%"
      },
      {
        "name": "HTML/CSS",
        "level": "100%"
      },
      {
        "name": "WEB3",
        "level": "100%"
      },
      {
        "name": "PYTHON",
        "level": "100%"
      },
      {
        "name": "Typescript",
        "level": "85%"
      },
      {
        "name": "GIT",
        "level": "93%"
      },
      {
        "name": "Selenium",
        "level": "100%"
      },
      {
        "name": "VueJs",
        "level": "70%"
      },
      {
        "name": "MongoDB",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Cyop",
        "category": "Cyop protocol",
        "image": "cyop.png",
        "url": "https://cyop.io"
      },
      {
        "title": "Socrates",
        "category": "Learn with Socrates",
        "image": "socrates.png",
        "url": "https://practiceplaygrow.com/"
      },
      {
        "title": "Peaceswap",
        "category": "Pancakeswap fork",
        "image": "peaceswap.PNG",
        "url": "https://peaceswap.com"
      },
      {
        "title": "Ecodollar",
        "category": "EcoDollar is classified as a crypto payment token.",
        "image": "ecodollar.PNG",
        "url": "https://ecodollar.org/"
      },
      {
        "title": "Demo-taptrust",
        "category": "Quadarata KYC NFT and demo token",
        "image": "demo-taptrust.png",
        "url": "https://demo.taptrust.com/"
      },
      {
        "title": "Crypstarter",
        "category": "Olympus DAO fork",
        "image": "crypstarter.PNG",
        "url": "http://app.crypstarter.finance/"
      },
      {
        "title": "Luuna",
        "category": "Ecommerce system",
        "image": "luuna.PNG",
        "url": "https://luuna.mx/"
      },
      {
        "title": "Medabots",
        "category": "Play and earn NFT game",
        "image": "medabots.PNG",
        "url": "https://medabots.game/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the opportunity to work with Nakamoto on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Tim excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Nakamoto fukuda must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
